brew 'zsh-completions'
brew 'brew-cask-completion'
brew 'git'
brew 'gpg'

brew 'go'
brew 'nodejs' # includes 'npm'
brew 'rustup'
brew 'yarn'
brew 'elm'
# brew 'elm-format'

brew 'watch'
brew 'tree'
brew 'jq'
brew 'direnv'

brew 'hub'
brew 'kubernetes-cli'
brew 'awscli'
brew 'terraform'
brew 'openconnect'
brew 'bitwarden-cli'

cask 'launchbar'
cask 'iterm2'
cask 'gitup'
cask 'zed'
cask 'visual-studio-code'
cask 'intellij-idea-ce'

cask 'docker'
cask 'postgres-unofficial'
cask 'postico'

cask 'xbar'
cask 'thingsmacsandboxhelper'
cask 'aws-vault'

cask 'finicky'
cask 'browserosaurus'
cask 'google-chrome'
cask 'firefox'


cask 'keybase'
# cask 'discord'
cask 'zoom'
cask 'spotify'

cask 'vlc'
cask 'transmission'

brew 'mas'

mas 'Moom',             id: 419330170
mas 'Bitwarden',        id: 1352778147
mas 'The Unarchiver',   id: 425424353
mas 'Slack',            id: 803453959
mas 'Things',           id: 904280696
mas 'Xcode',            id: 497799835
