brew 'bash-completion'
brew 'zsh-completion'
brew 'brew-cask-completion'
brew 'git'

brew 'nodejs' # includes 'npm'
brew 'yarn'
brew 'elm'
brew 'elm-format'
brew 'go'

brew 'watch'
brew 'tree'
brew 'jq'

brew 'hub'
brew 'kubernetes-cli'
brew 'awscli'
brew 'terraform'
# brew 'postgresql'

# tap 'versent/homebrew-taps'
# brew 'saml2aws'

cask 'textmate'
cask 'visual-studio-code'
cask 'intellij-idea-ce'

cask 'docker'
cask 'postgres'
cask 'iterm2'
cask 'gitup'

cask 'launchbar'
cask 'thingsmacsandboxhelper'
cask 'softu2f'
cask 'aws-vault'
cask 'postman'
cask 'google-cloud-sdk'

cask 'colloquy'
cask 'discord'
cask 'zoomus'
cask 'spotify'

cask 'google-chrome'
cask 'firefox'

cask 'vlc'
cask 'transmission'

system('/usr/libexec/java_home --failfast') || begin
  tap 'AdoptOpenJDK/openjdk'
  cask 'adoptopenjdk8'
end

brew 'mas'

mas 'Moom',             id: 419330170
mas 'The Unarchiver',   id: 425424353
mas 'Slack',            id: 803453959
mas 'Things',           id: 904280696
mas 'Xcode',            id: 497799835
