brew 'aws-sso-cli'
brew 'awscli'
brew 'bitwarden-cli'
brew 'direnv'
brew 'git'
brew 'git-delta'
brew 'go'
brew 'gpg'
brew 'hub'
brew 'jq'
brew 'kubernetes-cli'
brew 'mas'
brew 'nvm'
brew 'openconnect'
brew 'rustup'
brew 'terraform'
brew 'tree'
brew 'watch'
brew 'zsh-completions'


cask '1password'
cask '1password-cli'
cask 'anki'
cask 'brave-browser'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'fellow'
cask 'firefox'
cask 'fork'
cask 'gitup'
cask 'google-chrome'
cask 'iina'
cask 'intellij-idea'
cask 'iterm2'
cask 'kitty'
cask 'launchbar'
cask 'lens'
cask 'meld'
cask 'mongodb-compass'
cask 'orbstack'
cask 'postgres-unofficial'
cask 'postico'
cask 'spotify'
cask 'steam'
cask 'thingsmacsandboxhelper'
cask 'transmission'
cask 'visual-studio-code'
cask 'webex'
cask 'whisky'
cask 'zed'
cask 'zoom'


mas '1Password for Safari', id: 1569813296
mas 'Moom',                 id: 419330170
mas 'Slack',                id: 803453959
mas 'The Unarchiver',       id: 425424353
mas 'Things',               id: 904280696
mas 'Xcode',                id: 497799835
